redakker/esp8266-firmware-mqtt/webserver.cpp
                String action = server->arg("action") == NULL ? "" : server->arg("action");              
                String ssid = server->arg("ssid") == NULL ? "" : server->arg("ssid");
                String password = server->arg("password") == NULL ? "" : server->arg("password");
                
                if (action == "updatewifi") {  
                  root["ssid"] = ssid;
                  root["wifipasswd"] = password;                                  
                  eepromhandler->save(root);
                }


              
                content =  "<!DOCTYPE HTML><html>\r\n";
                content += " <head>\r\n";
                content += " <meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\" />\r\n";
                content += " <meta name=\"viewport\" content=\"width=device-width, initial-scale=1\" />\r\n";
                content += " <link rel=\"stylesheet\" href=\"http://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css\">\r\n";
                content += " </head>\r\n";
                content += " <body>\r\n";
                content += " <div class=\"container\">\r\n";

                if (action == "updatewifi") {
                  content += "<div class=\"alert alert-success\">Configuration is updated in EEPROM. Please restart the device to apply the new wifi connection!</div>";
                } else {
                  content += "<div class=\"alert\">&nbsp;</div>";
                }
    
                content += "<div class=\"pull-right\">";
                content += "<button type=\"button\" class=\"btn btn-warning\" onclick=\"location.href='/restart'\">Reboot  (reload config)</button>";
                content += "</div>";
                
                content += "  <div class=\"row\">\r\n";
                content += "   <form action=\"/\" method=\"get\" class=\"form-horizontal\" role=\"form\">\r\n";
                content += "    <div class=\"form-group\">";
                content += "      <label for=\"ssid\" class=\"col-sm-3 control-label\">Network</label>\r\n";
                content += "      <div class=\"col-sm-3\">\r\n";
                content += "        <select name=\"ssid\" id=\"ssid\" class=\"form-control\">\r\n";                
                
                for (int i = 0; i < networks->size(); i++){
                    String net = networks->get(i);
                    net.replace("*", "");
                    String netName = networks->get(i);
                    content += "<option value=\"";
                    content += net;
                    content += "\">";
                    content += netName;
                    content += "</option>\r\n";
                }
                content += "        </select>\r\n";
                content += "      </div>\r\n";
                content += "   </div>\r\n";
                content += "    <div class=\"form-group\">\r\n";
                content += "      <label for=\"password\" class=\"col-sm-3 control-label\">Password</label>\r\n";
                content += "      <div class=\"col-sm-9\">\r\n";
                content += "        <input  name=\"password\" type=\"password\" id=\"password\" placeholder=\"wifi password\" class=\"form-control\">\r\n";
                content += "      </div>\r\n";
                content += "    </div>\r\n";
                content += "    <hr />\r\n";    
                content += "    <div class=\"form-group\">\r\n";
                content += "      <div class=\"col-sm-9 col-sm-offset-3\">\r\n";
                content += "        <button type=\"submit\" class=\"btn btn-primary btn-block\">Submit</button>\r\n";
                content += "        <input type=\"hidden\" name=\"action\" value=\"updatewifi\">\r\n";
                content += "      </div>\r\n";
                content += "    </div>\r\n";
                content += "  </form> <!-- /form -->\r\n"; 
                content += " </div>\r\n";                     
                content += " </body>\r\n";
                content += " </html>\r\n";
                server->send(200, "text/html", content);
            });
          
        }

        server->on("/reset", [=]() {

            eepromhandler->reset();
          
            content =  "<!DOCTYPE HTML><html>\r\n";
            content += " <head>\r\n";
            content += " <meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\" />\r\n";
            content += " <meta name=\"viewport\" content=\"width=device-width, initial-scale=1\" />\r\n";
            content += " <link rel=\"stylesheet\" href=\"http://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css\">\r\n";
            content += " </head>\r\n";
            content += " <body>\r\n";
            content += " <div class=\"container\">\r\n";
            content += "  <div class=\"row\">\r\n";
            content += "    <div class=\"col-lg-12 col-centered\">\r\n";
            content += "      <h2>Reset was successful, the device is clean!</h2>\r\n";
            content += "      <br/>\r\n";
            content += "      <a href=\"/\">return</a>\r\n";
            content += "    </div>\r\n";
            content += "   </div>\r\n";
            content += " </div>\r\n";                     
            content += " </body>\r\n";
            content += " </html>\r\n";
            server->send(200, "text/html", content);
        });

        server->on("/restart", [=]() {
        
          
            content =  "<!DOCTYPE HTML><html>\r\n";
            content += " <head>\r\n";
            content += " <meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\" />\r\n";
            content += " <meta name=\"viewport\" content=\"width=device-width, initial-scale=1\" />\r\n";
            content += " <link rel=\"stylesheet\" href=\"http://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css\">\r\n";
            content += " </head>\r\n";
            content += " <body>\r\n";            
            content += " <div class=\"container\">\r\n";            
            content += "  <div class=\"row\">\r\n";
            content += "    <div class=\"col-lg-12 col-centered\">\r\n";
            content += "      <h2>Restart was successful! Please wait some seconds to complete the reboot and then return to the previous page</h2>\r\n";
            content += "      <br/>\r\n";
            content += "      <a href=\"/\">return</a>\r\n";
            content += "    </div>\r\n";
            content += "   </div>\r\n";
            content += " </div>\r\n";                     
            content += " </body>\r\n";
            content += " </html>\r\n";
            server->send(200, "text/html", content);

            eepromhandler->restart();
        });
    }
};
